Public Attributes | List of all members
API_ZoneCatType Struct Reference
Attribute Management
Zone category attribute representation. More...
#include <APIdefs_Attributes.h>
 Public Attributes
API_Attr_Head  | head
Contains the name and the index of the zone category attribute.
GS::uchar_t  | catCode [API_UniLongNameLen]
Contains the code for the zone category attribute.
GS::uchar_t  | stampName [API_UniLongNameLen]
API_Guid  | stampMainGuid
The main part of the unique identifier of the zone stamp library part.
API_Guid  | stampRevGuid
The revision part of the unique identifier of the zone stamp library part.
API_RGBColor  | rgb
The RGB components of the zone color.
Detailed Description
Zone category attribute representation.
Remarks
This attribute exists in Archicad only. One zone category always exists, i.e. you cannot delete the last zone category attribute. There are additional data assigned to zone category attributes in the API_AttributeDef structure; the current values of the parameters are passed through the zone_addParItems field. Refer to the API_AddParType structure to get more details on it.
Member Data Documentation
◆ catCode
 API_ZoneCatType::catCode
Contains the code for the zone category attribute.
◆ head
 API_ZoneCatType::head
Contains the name and the index of the zone category attribute.
Contains the name of the zone stamp library part for the zone category attribute.
◆ rgb
 API_ZoneCatType::rgb
The RGB components of the zone color.
◆ stampMainGuid
 API_ZoneCatType::stampMainGuid
The main part of the unique identifier of the zone stamp library part.
◆ stampName
 GS::uchar_t API_ZoneCatType::stampName[API_UniLongNameLen]
◆ stampRevGuid
 API_ZoneCatType::stampRevGuid
The revision part of the unique identifier of the zone stamp library part.